{
    "nodes": [
        {
            "op": "null",
            "name": "0:0",
            "inputs": [],
            "output_names": [
                "0:0"
            ],
            "is_param": "0"
        },
        {
            "op": "tvm_op",
            "name": "fused_41_copy",
            "attrs": {
                "func_name": "fused_41_copy",
                "flatten_data": "0",
                "num_inputs": "1",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    0,
                    0,
                    0
                ]
            ],
            "output_names": [
                "copy0:0"
            ]
        },
        {
            "op": "tvm_op",
            "name": "fused_40_transpose_nn_pad_transpose_nn_pad_copy",
            "attrs": {
                "func_name": "fused_40_transpose_nn_pad_transpose_nn_pad_copy",
                "flatten_data": "0",
                "num_inputs": "1",
                "num_outputs": "1"
            },
            "inputs": [
                [
                    1,
                    0,
                    0
                ]
            ],
            "output_names": [
                "nn.pad0:0"
            ]
        },
        {
            "op": "tvm_op",
            "name": "sg_tonga0",
            "attrs": {
                "func_name": "__kelf",
                "flatten_data": "0",
                "num_inputs": "1",
                "kelf": "kelf-a.json",
                "num_outputs": "2"
            },
            "inputs": [
                [
                    2,
                    0,
                    0
                ]
            ],
            "output_names": [
                "aten_permute/transpose:0",
                "double_conv_59/Sequential_1/BatchNorm2d_10/aten_relu/Relu:0"
            ]
        }
    ],
    "arg_nodes": [
        0
    ],
    "heads": [
        [
            3,
            0,
            0
        ],
        [
            3,
            1,
            0
        ]
    ],
    "attrs": {
        "shape": [
            "list_shape",
            [
                [
                    1,
                    3,
                    2400,
                    2400
                ],
                [
                    1,
                    3,
                    2400,
                    2400
                ],
                [
                    1,
                    3,
                    2402,
                    2404
                ],
                [
                    1,
                    1200,
                    1200,
                    2
                ],
                [
                    1,
                    32,
                    1200,
                    1200
                ]
            ]
        ],
        "storage_id": [
            "list_int",
            [
                0,
                1,
                2,
                1,
                3
            ]
        ],
        "dltype": [
            "list_str",
            [
                "float32",
                "float32",
                "float32",
                "float32",
                "float32"
            ]
        ]
    },
    "node_row_ptr": [
        0,
        1,
        2,
        3,
        5
    ],
    "metadata": {
        "signatures": {
            "default": {
                "inputs": {
                    "0:0": {
                        "id": 0,
                        "dtype": "float32",
                        "shape": [
                            1,
                            3,
                            2400,
                            2400
                        ]
                    }
                },
                "outputs": {
                    "sg_tonga0": {
                        "id": 3,
                        "dtype": "float32",
                        "shape": [
                            1,
                            1200,
                            1200,
                            2
                        ]
                    }
                }
            }
        }
    }
}